{"frontend": 0, "engineer": 1, "cloud": 2, "devops": 3, "role": 4, "summary": 5, "current": 6, "claim": 7, "engineering": 8, "client": 9, "side": 10, "native": 11, "mobile": 12, "experiences": 13, "android": 14, "applications": 15, "using": 16, "java": 17, "kotlin": 18, "work": 19, "experience": 20, "tech": 21, "mahindra": 22, "services": 23, "consulting": 24, "firm": 25, "33": 26, "months": 27, "development": 28, "more": 29, "recently": 30, "consumer": 31, "app": 32, "company": 33, "built": 34, "maintained": 35, "multiple": 36, "production": 37, "features": 38, "including": 39, "main": 40, "shopping": 41, "flow": 42, "push": 43, "notification": 44, "system": 45, "offline": 46, "first": 47, "sync": 48, "layer": 49, "comfortable": 50, "framework": 51, "jetpack": 52, "components": 53, "typical": 54, "patterns": 55, "mvvm": 56, "hilt": 57, "coroutines": 58, "my": 59, "career": 60, "has": 61, "been": 62, "entirely": 63, "so": 64, "far": 65, "interested": 66, "expanding": 67, "broader": 68, "backend": 69, "platform": 70, "mindtree": 71, "48": 72, "zomato": 73, "product": 74, "food": 75, "delivery": 76, "media": 77, "react": 78, "typescript": 79, "surrounding": 80, "tooling": 81, "webpack": 82, "jest": 83, "cypress": 84, "design": 85, "from": 86, "scratch": 87, "led": 88, "migration": 89, "legacy": 90, "angularjs": 91, "strong": 92, "craft": 93, "accessibility": 94, "performance": 95, "animations": 96, "limited": 97, "exposure": 98, "supporting": 99, "skills": 100, "langchain": 101, "34mo": 102, "advanced": 103, "education": 104, "ph": 105, "mechanical": 106, "regional": 107, "technical": 108, "institute": 109, "executing": 110, "manual": 111, "interface": 112, "validation": 113, "end": 114, "regression": 115, "testing": 116, "suites": 117, "selenium": 118, "pytest": 119, "hcl": 120, "42": 121, "test": 122, "automation": 123, "qa": 124, "fintech": 125, "suite": 126, "plus": 127, "load": 128, "setup": 129, "locust": 130, "worked": 131, "closely": 132, "developers": 133, "testability": 134, "acceptance": 135, "criteria": 136, "recent": 137, "shifting": 138, "responsibility": 139, "dev": 140, "team": 141, "moving": 142, "gate": 143, "coach": 144, "developer": 145, "32": 146, "sc": 147, "commerce": 148, "local": 149, "college": 150, "full": 151, "stack": 152, "systems": 153, "apis": 154, "razorpay": 155, "22": 156, "net": 157, "flipkart": 158, "15": 159, "cognizant": 160, "13": 161, "large": 162, "enterprise": 163, "spring": 164, "boot": 165, "microservices": 166, "kafka": 167, "inter": 168, "service": 169, "messaging": 170, "postgres": 171, "redis": 172, "storage": 173, "customer": 174, "onboarding": 175, "which": 176, "involved": 177, "orchestrating": 178, "downstream": 179, "solid": 180, "ecosystem": 181, "transaction": 182, "handling": 183, "operational": 184, "looking": 185, "either": 186, "go": 187, "deeper": 188, "distributed": 189, "expand": 190, "modern": 191, "application": 192, "stacks": 193, "mphasis": 194, "36": 195, "computer": 196, "tier": 197, "52": 198, "swiggy": 199, "12": 200, "kubeflow": 201, "47mo": 202, "lovely": 203, "professional": 204, "university": 205, "building": 206, "web": 207, "software": 208, "products": 209, "database": 210, "schemas": 211, "node": 212, "without": 213, "statistical": 214, "modeling": 215, "accenture": 216, "26": 217, "saas": 218, "based": 219, "admin": 220, "interfaces": 221, "js": 222, "rest": 223, "api": 224, "backing": 225, "them": 226, "across": 227, "endpoint": 228, "postgresql": 229, "schema": 230, "deployment": 231, "via": 232, "docker": 233, "kubernetes": 234, "most": 235, "parts": 236, "though": 237, "comfort": 238, "zone": 239, "learning": 240, "ci": 241, "cd": 242, "discipline": 243, "20": 244, "srm": 245, "tier_2": 246, "institution": 247, "developing": 248, "transactional": 249, "infrastructure": 250, "microservice": 251, "28": 252, "14": 253, "science": 254, "ai": 255, "specialist": 256, "ml": 257, "powered": 258, "solutions": 259, "configuring": 260, "tokenization": 261, "strategies": 262, "text": 263, "preprocessing": 264, "layers": 265, "training": 266, "custom": 267, "transformer": 268, "sequences": 269, "45": 270, "nlp": 271, "pipelines": 272, "sentiment": 273, "analysis": 274, "document": 275, "classification": 276, "primarily": 277, "internal": 278, "feedback": 279, "analytics": 280, "dashboard": 281, "started": 282, "sklearn": 283, "bag": 284, "words": 285, "models": 286, "moved": 287, "classifiers": 288, "distilbert": 289, "harder": 290, "classes": 291, "pytorch": 292, "hugging": 293, "face": 294, "small": 295, "datasets": 296, "pre": 297, "trained": 298, "model": 299, "fine": 300, "tuning": 301, "core": 302, "transformers": 303, "49mo": 304, "llamaindex": 305, "32mo": 306, "milvus": 307, "30mo": 308, "iit": 309, "madras": 310, "tier_1": 311, "cred": 312, "19": 313, "python": 314, "38mo": 315, "electrical": 316, "symbiosis": 317, "international": 318, "operating": 319, "networks": 320, "automated": 321, "runs": 322, "clusters": 323, "aws": 324, "terraform": 325, "37": 326, "owned": 327, "account": 328, "architecture": 329, "vpc": 330, "iam": 331, "networking": 332, "modules": 333, "our": 334, "deployments": 335, "cluster": 336, "operations": 337, "designed": 338, "gitlab": 339, "argocd": 340, "monitoring": 341, "prometheus": 342, "grafana": 343, "loki": 344, "infra": 345, "ops": 346, "haven": 347, "done": 348, "much": 349, "wipro": 350, "34": 351, "31": 352, "41mo": 353, "mlops": 354, "22mo": 355, "physics": 356, "chandigarh": 357, "yrs": 358, "data": 359, "transformation": 360, "pipeline": 361, "cleaning": 362, "messy": 363, "views": 364, "dbt": 365, "snowflake": 366, "unacademy": 367, "edtech": 368, "38": 369, "analytical": 370, "warehouse": 371, "bi": 372, "50": 373, "dashboards": 374, "wrote": 375, "complex": 376, "sql": 377, "heavy": 378, "window": 379, "functions": 380, "ctes": 381, "incremental": 382, "dimensional": 383, "slowly": 384, "changing": 385, "dimensions": 386, "well": 387, "optimization": 388, "query": 389, "sizing": 390, "materialized": 391, "also": 392, "lineage": 393, "documentation": 394, "now": 395, "use": 396, "org": 397, "42mo": 398, "21mo": 399, "vit": 400, "chennai": 401, "exclusively": 402, "vision": 403, "image": 404, "moderation": 405, "zero": 406, "information": 407, "retrieval": 408, "mad": 409, "street": 410, "den": 411, "feature": 412, "tuned": 413, "resnet": 414, "variants": 415, "labeled": 416, "dataset": 417, "200k": 418, "images": 419, "set": 420, "up": 421, "loading": 422, "augmentation": 423, "evaluation": 424, "inference": 425, "project": 426, "cv": 427, "transitioning": 428, "toward": 429, "llm": 430, "byju": 431, "58": 432, "contributed": 433, "fraud": 434, "detection": 435, "flask": 436, "prediction": 437, "integrating": 438, "store": 439, "writing": 440, "serving": 441, "observability": 442, "senior": 443, "scientists": 444, "own": 445, "secondary": 446, "vector": 447, "search": 448, "19mo": 449, "qdrant": 450, "18mo": 451, "verified": 452, "85": 453, "100": 454, "74": 455, "certifications": 456, "deep": 457, "specialization": 458, "coursera": 459, "deeplearning": 460, "2021": 461, "2019": 462, "machine": 463, "bits": 464, "pilani": 465, "spark": 466, "scale": 467, "batch": 468, "processing": 469, "lake": 470, "engines": 471, "apache": 472, "25": 473, "airflow": 474, "500gb": 475, "daily": 476, "source": 477, "extensively": 478, "pyspark": 479, "call": 480, "rotation": 481, "quality": 482, "issues": 483, "checks": 484, "detect": 485, "drift": 486, "unusual": 487, "volume": 488, "changes": 489, "supports": 490, "few": 491, "analyst": 492, "infosys": 493, "sentence": 494, "33mo": 495, "rank": 496, "28mo": 497, "tensorflow": 498, "25mo": 499, "59mo": 500, "78": 501, "iiit": 502, "hyderabad": 503, "39": 504, "16": 505, "embeddings": 506, "27": 507, "enthusiast": 508, "optimizing": 509, "business": 510, "metric": 511, "forecasting": 512, "targets": 513, "tabular": 514, "extraction": 515, "flows": 516, "scikit": 517, "learn": 518, "frameworks": 519, "aganitha": 520, "facing": 521, "predictive": 522, "churn": 523, "conversion": 524, "likelihood": 525, "lifetime": 526, "value": 527, "estimation": 528, "used": 529, "xgboost": 530, "were": 531, "gradient": 532, "boosted": 533, "trees": 534, "80": 535, "hand": 536, "engineered": 537, "split": 538, "roughly": 539, "60": 540, "40": 541, "between": 542, "prep": 543, "retention": 544, "than": 545, "productionization": 546, "57mo": 547, "prompt": 548, "44mo": 549, "53": 550, "google": 551, "2023": 552, "46": 553, "60mo": 554, "bharati": 555, "vidyapeeth": 556, "coep": 557, "pune": 558, "researching": 559, "filtering": 560, "mathematical": 561, "matrix": 562, "factorization": 563, "recommendation": 564, "style": 565, "mid": 566, "stage": 567, "startup": 568, "lighter": 569, "weight": 570, "ranking": 571, "faang": 572, "combination": 573, "collaborative": 574, "implicit": 575, "library": 576, "re": 577, "over": 578, "engagement": 579, "signals": 580, "pure": 581, "handled": 582, "yellow": 583, "time": 584, "series": 585, "supply": 586, "chain": 587, "demand": 588, "logistics": 589, "prophet": 590, "lightgbm": 591, "one": 592, "lstm": 593, "ended": 594, "shipping": 595, "ran": 596, "some": 597, "reinforcement": 598, "experiments": 599, "dynamic": 600, "pricing": 601, "those": 602, "didn": 603, "make": 604, "mix": 605, "stakeholder": 606, "communication": 607, "crafting": 608, "user": 609, "anna": 610, "amity": 611, "49": 612, "opensearch": 613, "53mo": 614, "72": 615, "vedantu": 616, "24": 617, "hybrid": 618, "growth": 619, "proper": 620, "migrating": 621, "tangled": 622, "replicas": 623, "clean": 624, "orchestration": 625, "integration": 626, "looker": 627, "shipped": 628, "couple": 629, "bulk": 630, "research": 631, "haptik": 632, "conversational": 633, "scientist": 634, "saarthi": 635, "voice": 636, "rephrase": 637, "27mo": 638, "77": 639, "2020": 640, "splitting": 641, "lightweight": 642, "clustering": 643, "focus": 644, "inmobi": 645, "adtech": 646, "mixed": 647, "marketing": 648, "spent": 649, "maybe": 650, "30": 651, "70": 652, "wouldn": 653, "myself": 654, "experimentation": 655, "tests": 656, "implemented": 657, "streaming": 658, "real": 659, "activity": 660, "registry": 661, "watermark": 662, "state": 663, "management": 664, "approach": 665, "deduplication": 666, "logic": 667, "late": 668, "arriving": 669, "events": 670, "sure": 671, "aligned": 672, "what": 673, "needed": 674, "adjacent": 675, "dream11": 676, "gaming": 677, "fastapi": 678, "b2b": 679, "reporting": 680, "serves": 681, "3k": 682, "paying": 683, "customers": 684, "includes": 685, "another": 686, "itself": 687, "reliability": 688, "rv": 689, "semantic": 690, "56": 691, "technology": 692, "meesho": 693, "mlflow": 694, "52mo": 695, "capgemini": 696, "58mo": 697, "mathematics": 698, "civil": 699, "christ": 700, "51": 701, "24mo": 702, "artificial": 703, "intelligence": 704, "delhi": 705, "76": 706, "17": 707, "massachusetts": 708, "phonepe": 709, "upgrad": 710, "51mo": 711, "39mo": 712, "37mo": 713, "weaviate": 714, "50mo": 715, "43mo": 716, "43": 717, "peft": 718, "tcs": 719, "44": 720, "18": 721, "statistics": 722, "kiit": 723, "54mo": 724, "26mo": 725, "45mo": 726, "generic": 727, "structuring": 728, "warehouses": 729, "houses": 730, "metadata": 731, "catalogs": 732, "early": 733, "startups": 734, "vjti": 735, "mumbai": 736, "zoho": 737, "scaling": 738, "high": 739, "throughput": 740, "wrappers": 741, "around": 742, "existing": 743, "endpoints": 744, "pinecone": 745, "29mo": 746, "chemical": 747, "21": 748, "qlora": 749, "36mo": 750, "54": 751, "pharmeasy": 752, "healthtech": 753, "nykaa": 754, "elasticsearch": 755, "wysa": 756, "pgvector": 757, "23mo": 758, "thapar": 759, "genpact": 760, "glance": 761, "55mo": 762, "20mo": 763, "84": 764, "ola": 765, "transportation": 766, "mba": 767, "junior": 768, "niramai": 769, "haystack": 770, "rag": 771, "stanford": 772, "vellore": 773, "56mo": 774, "iisc": 775, "bangalore": 776, "policybazaar": 777, "insurance": 778, "faiss": 779, "66": 780, "paytm": 781, "lora": 782, "manipal": 783, "63": 784, "57": 785, "recursive": 786, "tree": 787, "architectures": 788, "structural": 789, "48mo": 790, "31mo": 791, "35mo": 792, "62": 793, "llms": 794, "82": 795, "46mo": 796, "2018": 797, "deploying": 798, "low": 799, "latency": 800, "event": 801, "bus": 802, "topologies": 803, "consumption": 804, "75": 805, "implementing": 806, "risk": 807, "managing": 808, "structured": 809, "stores": 810, "kanpur": 811, "23": 812, "29": 813, "67": 814, "10": 815, "pes": 816, "73": 817, "2022": 818, "2025": 819, "locobuzz": 820, "nit": 821, "warangal": 822, "jadavpur": 823, "electronics": 824, "bm25": 825, "guwahati": 826, "55": 827, "35": 828, "59": 829, "certified": 830, "specialty": 831, "47": 832, "freshworks": 833, "81": 834, "69": 835, "verloop": 836, "io": 837, "65": 838, "41": 839, "sarvam": 840, "40mo": 841, "kharagpur": 842, "observe": 843, "roorkee": 844, "68": 845, "86": 846, "georgia": 847, "71": 848, "11": 849, "64": 850, "surathkal": 851, "2024": 852, "carnegie": 853, "mellon": 854, "87": 855, "bombay": 856, "trichy": 857, "uc": 858, "berkeley": 859, "79": 860, "applied": 861, "intelligent": 862, "artifact": 863, "version": 864, "tracking": 865, "big": 866, "internet": 867, "operated": 868, "experiment": 869, "success": 870, "prioritize": 871, "outreach": 872, "distribution": 873, "alerting": 874, "mentored": 875, "through": 876, "last": 877, "year": 878, "discovery": 879, "feed": 880, "three": 881, "families": 882, "content": 883, "behavior": 884, "item": 885, "history": 886, "online": 887, "correlation": 888, "determined": 889, "metrics": 890, "actually": 891, "predicted": 892, "outcomes": 893, "pms": 894, "define": 895, "target": 896, "click": 897, "vs": 898, "dwell": 899, "important": 900, "10m": 901, "users": 902, "combined": 903, "uses": 904, "similarity": 905, "cold": 906, "starts": 907, "warm": 908, "went": 909, "200": 910, "launch": 911, "improved": 912, "day": 913, "per": 914, "session": 915, "86mo": 916, "expert": 917, "72mo": 918, "67mo": 919, "90": 920, "61": 921, "engine": 922, "scoring": 923, "adjusting": 924, "index": 925, "configurations": 926, "relevancy": 927, "evolving": 928, "function": 929, "relevance": 930, "labeling": 931, "explicit": 932, "human": 933, "judgments": 934, "eval": 935, "workflow": 936, "part": 937, "almost": 938, "easy": 939, "bit": 940, "final": 941, "revenue": 942, "79mo": 943, "developed": 944, "knowledge": 945, "base": 946, "500k": 947, "documents": 948, "all": 949, "minilm": 950, "l6": 951, "v2": 952, "initially": 953, "later": 954, "upgraded": 955, "bge": 956, "fast": 957, "nearest": 958, "neighbor": 959, "expansion": 960, "module": 961, "handles": 962, "vocabulary": 963, "mismatch": 964, "queries": 965, "terms": 966, "reported": 967, "improvement": 968, "prior": 969, "validated": 970, "amazon": 971, "83mo": 972, "69mo": 973, "64mo": 974, "88": 975, "2030": 976, "designing": 977, "embedding": 978, "generation": 979, "indices": 980, "83": 981, "krutrim": 982, "balancing": 983, "lifecycle": 984, "streams": 985, "strict": 986, "staff": 987, "linkedin": 988, "flagship": 989, "how": 990, "do": 991, "we": 992, "surface": 993, "right": 994, "thing": 995, "millions": 996, "items": 997, "hard": 998, "problem": 999, "rarely": 1000, "fed": 1001, "told": 1002, "us": 1003, "whether": 1004, "keeping": 1005, "healthy": 1006, "represented": 1007, "internally": 1008, "relevant": 1009, "results": 1010, "appear": 1011, "each": 1012, "intent": 1013, "spanned": 1014, "algorithms": 1015, "methodology": 1016, "direct": 1017, "collaboration": 1018, "pm": 1019, "means": 1020, "fair": 1021, "amount": 1022, "correlated": 1023, "turned": 1024, "out": 1025, "hardest": 1026, "61mo": 1027, "platforms": 1028, "context": 1029, "assembly": 1030, "middleware": 1031, "protocols": 1032, "support": 1033, "chatbot": 1034, "integrated": 1035, "ticketing": 1036, "ingestion": 1037, "chunking": 1038, "openai": 1039, "storing": 1040, "answer": 1041, "gpt": 1042, "smaller": 1043, "cost": 1044, "control": 1045, "both": 1046, "automatic": 1047, "bleu": 1048, "rouge": 1049, "loop": 1050, "scores": 1051, "cut": 1052, "average": 1053, "ticket": 1054, "resolution": 1055, "supported": 1056, "categories": 1057, "88mo": 1058, "16mo": 1059, "lead": 1060, "ex": 1061, "top": 1062, "dense": 1063, "sparse": 1064, "50m": 1065, "month": 1066, "recruiter": 1067, "hnsw": 1068, "ranker": 1069, "falling": 1070, "back": 1071, "when": 1072, "budget": 1073, "tight": 1074, "ndcg": 1075, "mrr": 1076, "recall": 1077, "calibrated": 1078, "against": 1079, "drove": 1080, "surfaced": 1081, "reranking": 1082, "edge": 1083, "cases": 1084, "rollout": 1085, "corpus": 1086, "35m": 1087, "migrated": 1088, "only": 1089, "combining": 1090, "vectors": 1091, "mpnet": 1092, "domain": 1093, "new": 1094, "reduced": 1095, "p95": 1096, "while": 1097, "improving": 1098, "held": 1099, "substantial": 1100, "boring": 1101, "critical": 1102, "refresh": 1103, "engineers": 1104, "95mo": 1105, "93mo": 1106, "75mo": 1107, "68mo": 1108, "62mo": 1109, "apple": 1110, "80mo": 1111, "77mo": 1112}