{"operations": 0, "manager": 1, "12": 2, "yrs": 3, "experience": 4, "professional": 5, "years": 6, "my": 7, "background": 8, "marketing": 9, "ve": 10, "built": 11, "led": 12, "teams": 13, "owned": 14, "kpis": 15, "driven": 16, "business": 17, "outcomes": 18, "domain": 19, "lately": 20, "been": 21, "curious": 22, "about": 23, "how": 24, "ai": 25, "tools": 26, "could": 27, "augment": 28, "work": 29, "experimented": 30, "chatgpt": 31, "few": 32, "other": 33, "productivity": 34, "content": 35, "creation": 36, "think": 37, "space": 38, "exciting": 39, "open": 40, "roles": 41, "where": 42, "can": 43, "apply": 44, "expertise": 45, "alongside": 46, "emerging": 47, "capabilities": 48, "wipro": 49, "services": 50, "10001": 51, "employees": 52, "company": 53, "43": 54, "months": 55, "customer": 56, "support": 57, "team": 58, "lead": 59, "saas": 60, "product": 61, "managed": 62, "agents": 63, "handling": 64, "tier": 65, "tickets": 66, "escalation": 67, "process": 68, "engineering": 69, "feedback": 70, "loop": 71, "out": 72, "knowledge": 73, "base": 74, "agent": 75, "training": 76, "program": 77, "strong": 78, "people": 79, "management": 80, "side": 81, "lighter": 82, "technical": 83, "depth": 84, "beyond": 85, "14": 86, "mechanical": 87, "design": 88, "role": 89, "hardware": 90, "two": 91, "subsystems": 92, "through": 93, "full": 94, "lifecycle": 95, "concept": 96, "dfm": 97, "dfma": 98, "review": 99, "prototype": 100, "production": 101, "tooling": 102, "comfortable": 103, "cad": 104, "solidworks": 105, "creo": 106, "fea": 107, "ansys": 108, "typical": 109, "development": 110, "cadence": 111, "worked": 112, "closely": 113, "manufacturing": 114, "partners": 115, "scale": 116, "up": 117, "acme": 118, "corp": 119, "201": 120, "500": 121, "54": 122, "writing": 123, "seo": 124, "strategy": 125, "tech": 126, "focused": 127, "publication": 128, "wrote": 129, "longform": 130, "articles": 131, "developer": 132, "cloud": 133, "platforms": 134, "ml": 135, "topics": 136, "including": 137, "some": 138, "ranked": 139, "first": 140, "page": 141, "search": 142, "high": 143, "competition": 144, "keywords": 145, "freelance": 146, "writer": 147, "pool": 148, "editorial": 149, "calendar": 150, "recent": 151, "has": 152, "assisted": 153, "using": 154, "llm": 155, "research": 156, "drafting": 157, "editing": 158, "while": 159, "maintaining": 160, "quality": 161, "dunder": 162, "mifflin": 163, "paper": 164, "products": 165, "38": 166, "brand": 167, "creative": 168, "direction": 169, "consumer": 170, "identity": 171, "logo": 172, "visual": 173, "system": 174, "typography": 175, "packaging": 176, "digital": 177, "across": 178, "web": 179, "social": 180, "rebrand": 181, "small": 182, "external": 183, "agency": 184, "adobe": 185, "suite": 186, "figma": 187, "education": 188, "sc": 189, "mathematics": 190, "from": 191, "local": 192, "college": 193, "tier_4": 194, "driving": 195, "infosys": 196, "20": 197, "analyst": 198, "globex": 199, "inc": 200, "501": 201, "1000": 202, "10": 203, "logistics": 204, "daily": 205, "fulfillment": 206, "warehouses": 207, "managing": 208, "80": 209, "receiving": 210, "picking": 211, "packing": 212, "outbound": 213, "tracked": 214, "operational": 215, "time": 216, "accuracy": 217, "cost": 218, "per": 219, "order": 220, "continuous": 221, "improvement": 222, "initiatives": 223, "drove": 224, "22": 225, "gain": 226, "over": 227, "18": 228, "machine": 229, "learning": 230, "accountant": 231, "helping": 232, "11": 233, "spent": 234, "career": 235, "mostly": 236, "relationships": 237, "stark": 238, "industries": 239, "1001": 240, "5000": 241, "52": 242, "consulting": 243, "firm": 244, "working": 245, "primarily": 246, "retail": 247, "cpg": 248, "clients": 249, "conducted": 250, "diagnostics": 251, "re": 252, "transformation": 253, "projects": 254, "stakeholder": 255, "structured": 256, "problem": 257, "solving": 258, "toolkit": 259, "slide": 260, "craft": 261, "excel": 262, "modeling": 263, "executive": 264, "communication": 265, "project": 266, "involved": 267, "advisory": 268, "own": 269, "limited": 270, "hr": 271, "45": 272, "senior": 273, "accounting": 274, "mid": 275, "sized": 276, "month": 277, "end": 278, "close": 279, "financial": 280, "reporting": 281, "statutory": 282, "compliance": 283, "gaap": 284, "ind": 285, "tax": 286, "filings": 287, "gl": 288, "fixed": 289, "asset": 290, "register": 291, "audit": 292, "readiness": 293, "function": 294, "staff": 295, "accountants": 296, "discipline": 297, "around": 298, "cycle": 299, "reducing": 300, "days": 301, "last": 302, "initech": 303, "software": 304, "51": 305, "200": 306, "24": 307, "tcs": 308, "core": 309, "skills": 310, "image": 311, "classification": 312, "38mo": 313, "advanced": 314, "information": 315, "technology": 316, "chandigarh": 317, "university": 318, "tier_3": 319, "wayne": 320, "enterprises": 321, "conglomerate": 322, "33": 323, "engineer": 324, "pied": 325, "piper": 326, "50": 327, "artificial": 328, "intelligence": 329, "lovely": 330, "civil": 331, "27": 332, "data": 333, "science": 334, "srm": 335, "tier_2": 336, "frontend": 337, "stack": 338, "backend": 339, "systems": 340, "fundamentals": 341, "comfort": 342, "zone": 343, "database": 344, "keeping": 345, "self": 346, "learner": 347, "level": 348, "taken": 349, "online": 350, "courses": 351, "played": 352, "openai": 353, "anthropic": 354, "apis": 355, "rag": 356, "haven": 357, "done": 358, "capacity": 359, "yet": 360, "either": 361, "deepen": 362, "start": 363, "contributing": 364, "adjacent": 365, "zomato": 366, "food": 367, "delivery": 368, "5001": 369, "10000": 370, "media": 371, "react": 372, "typescript": 373, "surrounding": 374, "webpack": 375, "jest": 376, "cypress": 377, "scratch": 378, "migration": 379, "legacy": 380, "angularjs": 381, "app": 382, "accessibility": 383, "performance": 384, "animations": 385, "exposure": 386, "48": 387, "test": 388, "automation": 389, "qa": 390, "fintech": 391, "maintained": 392, "selenium": 393, "pytest": 394, "plus": 395, "load": 396, "testing": 397, "setup": 398, "locust": 399, "developers": 400, "testability": 401, "patterns": 402, "acceptance": 403, "criteria": 404, "shifting": 405, "responsibility": 406, "dev": 407, "moving": 408, "gate": 409, "coach": 410, "entirely": 411, "java": 412, "19": 413, "android": 414, "mobile": 415, "more": 416, "recently": 417, "kotlin": 418, "multiple": 419, "features": 420, "main": 421, "shopping": 422, "flow": 423, "push": 424, "notification": 425, "offline": 426, "sync": 427, "layer": 428, "framework": 429, "jetpack": 430, "components": 431, "mvvm": 432, "hilt": 433, "coroutines": 434, "so": 435, "far": 436, "interested": 437, "expanding": 438, "broader": 439, "platform": 440, "faiss": 441, "44mo": 442, "opensearch": 443, "59mo": 444, "opencv": 445, "60mo": 446, "yolo": 447, "gans": 448, "33mo": 449, "verified": 450, "assessments": 451, "78": 452, "100": 453, "statistics": 454, "devops": 455, "frontends": 456, "rest": 457, "deployments": 458, "most": 459, "parts": 460, "razorpay": 461, "31": 462, "infrastructure": 463, "enterprise": 464, "aws": 465, "account": 466, "architecture": 467, "vpc": 468, "iam": 469, "networking": 470, "terraform": 471, "modules": 472, "our": 473, "service": 474, "kubernetes": 475, "cluster": 476, "designed": 477, "ci": 478, "cd": 479, "pipelines": 480, "gitlab": 481, "argocd": 482, "monitoring": 483, "prometheus": 484, "grafana": 485, "loki": 486, "infra": 487, "ops": 488, "much": 489, "application": 490, "hooli": 491, "large": 492, "spring": 493, "boot": 494, "microservices": 495, "kafka": 496, "inter": 497, "messaging": 498, "postgres": 499, "redis": 500, "storage": 501, "onboarding": 502, "which": 503, "orchestrating": 504, "downstream": 505, "solid": 506, "ecosystem": 507, "transaction": 508, "looking": 509, "go": 510, "deeper": 511, "distributed": 512, "expand": 513, "modern": 514, "stacks": 515, "ph": 516, "32": 517, "13": 518, "cnn": 519, "55mo": 520, "computer": 521, "44": 522, "26": 523, "iisc": 524, "bangalore": 525, "tier_1": 526, "mahindra": 527, "mindtree": 528, "langchain": 529, "34mo": 530, "regional": 531, "institute": 532, "36": 533, "based": 534, "admin": 535, "interfaces": 536, "node": 537, "js": 538, "api": 539, "backing": 540, "them": 541, "endpoint": 542, "postgresql": 543, "schema": 544, "deployment": 545, "via": 546, "docker": 547, "though": 548, "20mo": 549, "peft": 550, "35mo": 551, "24mo": 552, "weights": 553, "biases": 554, "iit": 555, "bombay": 556, "recommendation": 557, "ranking": 558, "retrieval": 559, "building": 560, "powered": 561, "nlp": 562, "applied": 563, "feature": 564, "migrated": 565, "keyword": 566, "embedding": 567, "learned": 568, "problems": 569, "actually": 570, "evaluation": 571, "disguise": 572, "academic": 573, "cs": 574, "come": 575, "shipping": 576, "real": 577, "seeing": 578, "what": 579, "holds": 580, "under": 581, "ic": 582, "ideally": 583, "companies": 584, "meaningful": 585, "piece": 586, "swiggy": 587, "trained": 588, "shipped": 589, "models": 590, "discovery": 591, "feed": 592, "xgboost": 593, "lightgbm": 594, "three": 595, "families": 596, "metadata": 597, "user": 598, "behavior": 599, "signals": 600, "item": 601, "engagement": 602, "history": 603, "correlation": 604, "analysis": 605, "determined": 606, "metrics": 607, "predicted": 608, "pms": 609, "define": 610, "optimization": 611, "target": 612, "click": 613, "vs": 614, "dwell": 615, "conversion": 616, "important": 617, "itself": 618, "mad": 619, "street": 620, "den": 621, "16": 622, "uber": 623, "transportation": 624, "commerce": 625, "evolving": 626, "hand": 627, "tuned": 628, "scoring": 629, "rank": 630, "model": 631, "relevance": 632, "labeling": 633, "pipeline": 634, "mix": 635, "explicit": 636, "human": 637, "judgments": 638, "eval": 639, "workflow": 640, "part": 641, "almost": 642, "easy": 643, "bit": 644, "final": 645, "improved": 646, "revenue": 647, "mlflow": 648, "21mo": 649, "pinecone": 650, "88mo": 651, "expert": 652, "28mo": 653, "23mo": 654, "embeddings": 655, "84mo": 656, "hugging": 657, "face": 658, "transformers": 659, "36mo": 660, "26mo": 661, "sentence": 662, "69mo": 663, "scikit": 664, "learn": 665, "68": 666, "net": 667, "conventional": 668, "databases": 669, "queues": 670, "cognizant": 671, "28": 672, "hcl": 673, "40": 674, "speech": 675, "recognition": 676, "19mo": 677, "30mo": 678, "54mo": 679, "vit": 680, "chennai": 681, "substantial": 682, "cross": 683, "functional": 684, "collaboration": 685, "execution": 686, "21": 687, "leadership": 688, "b2b": 689, "demand": 690, "generation": 691, "paid": 692, "acquisition": 693, "email": 694, "nurture": 695, "sales": 696, "definitions": 697, "sdr": 698, "handoff": 699, "focus": 700, "segment": 701, "bentoml": 702, "generic": 703, "state": 704, "object": 705, "detection": 706, "37mo": 707, "kiit": 708, "34": 709, "weaviate": 710, "27mo": 711, "electrical": 712, "42": 713, "23": 714, "30": 715, "25": 716, "elasticsearch": 717, "kubeflow": 718, "haystack": 719, "reinforcement": 720, "50mo": 721, "electronics": 722, "15": 723, "solutions": 724, "market": 725, "carried": 726, "8m": 727, "arr": 728, "quota": 729, "consistently": 730, "delivered": 731, "against": 732, "prospecting": 733, "se": 734, "commercial": 735, "negotiation": 736, "consultative": 737, "selling": 738, "buyers": 739, "engaging": 740, "both": 741, "finance": 742, "stakeholders": 743, "graphic": 744, "designer": 745, "christ": 746, "cred": 747}